Бакин Владислав Артемович

ИВТ-23-1б

# 1 Вариант задания

Лабораторная работа № 7_1 вариант 5

Написать перегруженные функции и основную программу, которая их вызывает.

1. для умножения вещественных чисел;
2. для умножения комплексных чисел.

# 2.1 Код программы

```cpp
#include <iostream>
#include <complex>
using namespace std;


template <typename N> 
N multiplication(N num1, N num2) {
    return num1 * num2;
}


int main() {
    float n1, n2;
    cout << "Введите первое вещественное число:" << endl;
    cin >> n1;
    cout << "Введите второе вещественное число:" << endl;
    cin >> n2;
    cout << "Результат умножения двух вещественных чисел: " << multiplication(n1, n2) << endl;


    double real1, real2, imag1, imag2;
    cout << "Введите действительную и мнимую часть первого числа через пробел:" << endl;
    cin >> real1 >> imag1;
    cout << "Введите действительную и мнимую часть второго числа через пробел:" << endl;
    cin >> real2 >> imag2;
    
    complex<double> z1(real1, imag1);
    complex<double> z2(real2, imag2); 
    
    cout << "Результат умножения двух комплексных чисел: " << multiplication(z1, z2) << endl;

    return 0;
}
```

# 2.2 Блок-схема программы

<image src="7_1_5.png">

# Тесты

### Пример 1

Входные данные:

```
Введите первое вещественное число:
2
Введите второе вещественное число:
3.5
```

Выходные данные:

```
Результат умножения двух вещественных чисел: 7
Результат умножения двух комплексных чисел: (0,5)
```

### Пример 2

Входные данные:

```
Введите первое вещественное число:
7.23
Введите второе вещественное число:
5.43
Введите действительную и мнимую часть первого числа через пробел:
3 12
Введите действительную и мнимую часть второго числа через пробел:
3.2 4.5
```

Выходные данные:

```
Результат умножения двух вещественных чисел: 39.2589
Результат умножения двух комплексных чисел: (-44.4,51.9)
```

### Пример 3

Входные данные:

```
Результат умножения двух комплексных чисел: (-44.4,51.9)Введите первое вещественное число:
-2.5
Введите второе вещественное число:
1
Введите действительную и мнимую часть первого числа через пробел:
-1 -1
Введите действительную и мнимую часть второго числа через пробел:
10 15
```

Выходные данные:

```
Результат умножения двух вещественных чисел: -2.5
Результат умножения двух комплексных чисел: (5,-25)
```