Бакин Владислав Артемович

ИВТ-23-1б

# 1 Вариант задания

Лабораторная работа № 3 (Фибоначчи)

Вводиться число n - длина последовательности. Вывести последовательность чисел Фибоначчи.

# 2.1 Код программы

```cpp
#include <iostream>
using namespace std;


int fibonacci(int x) {
    if (x == 0) {
        return 0;
    }
    else if (x == 1) {
        return 1;
    }
    return fibonacci(x - 1) + fibonacci(x - 2);
}


int main() {
    int position;       
    cin >> position;    // номер числа, до которого выводим последовательность Фибоначчи включительно

    for (int i = 0; i < position; i++) {
        cout << fibonacci(i) << " ";
    }

    return 0;
}
```

# 2.2 Блок-схема программы

<image src="images/fibonacci.png">

# Тесты

### Пример 1

Входные данные:

```
1
```

Выходные данные:

```
0
```

### Пример 2

Входные данные:

```
7
```

Выходные данные:

```
0 1 1 2 3 5 8
```

### Пример 3

Входные данные:

```
12
```

Выходные данные:

```
0 1 1 2 3 5 8 13 21 34 55 89
```