# 1 Постановка задачи

Дано:
1. Число n - размер квадратной матрицы,
2. квадратная матрица n-ого порядка.

Нужно определить является ли матрица ортонормированной. Для этого мы умножаем данную матрицу на матрицу транспонированную данной, если получаем единичную матрицу (матрица, у которой элементы главной диагонали равны 1, а остальные элементы равны 0), то данная матрица ортонормированная.

# 2 Вариант задания

Лабораторная работа № 5, вариант 5

**Функции и массивы**

Задание:

Определить является ли матрица ортонормированной, т. е. такой, что скалярное произведение каждой пары различных строк равно 0, а скалярное произведение строки самой на себя равно 1.

# 3.1 Код программы

```cpp
#include <iostream>
using namespace std;

// Лабораторная работа № 5, вариант 5
const int n = 3;    // размер квадратной матрицы

/* Функция для вычисления значения элемента a[line + 1][column + 1] в матрице, 
полученной путем умножения данной матрицы (matrix[n][n]) на данную транспонированную матрицу:*/
int multiplication(int matrix[n][n], int line, int column) {    
    int s = 0;
    for (int i = 0; i < n; i++) {
        s += (matrix[line][i] * matrix[column][i]);
    }
    return s;
}


int main() {
    int matrix[n][n];
    int el;
    bool flag = 1;
    
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            matrix[i][j] = rand() % 10;     // заполняем массив (матрицу) случайными ЦЕЛЫМИ числами от 0 до 9  
        }
    }

    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            if (i == j) {       // проверяем находится ли элемент на главной диагонали
                el = multiplication(matrix, i, j);
                if (el != 1) {
                    flag = 0;
                }
            }
            else {
                el = multiplication(matrix, i, j);
                if (el != 0) {
                    flag = 0;
                }
            }
        }
    }

    cout << "Матрица: " << endl;
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            cout << matrix[i][j] << " ";
        }
        cout << endl;     
    }
    if (flag) {
        cout << "Является ортонормированной" << endl;
    }
    else {
        cout << "Не является ортонормированной" << endl;
    }

    return 0;
}
```

# 3.2 Блок-схема программы

<image src="5_5.png">

# Тесты

### Пример 1.

Входные данные:

```cpp
const int n = 3;
```

Выходные данные:

```
Матрица: 
3 6 7 
5 3 5 
6 2 9 
Не является ортонормированной
```

Для следующих примеров блок кода отвечающий за наполнение матрицы случайными числами

```cpp
for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            matrix[i][j] = rand() % 10;     // заполняем массив (матрицу) случайными ЦЕЛЫМИ числами от 0 до 9  
        }
    }
```

исключается. Заполнение матрицы происходит при инициализации массива.

### Пример 2.

Входные данные:

```cpp
const int n = 3;
int matrix[n][n] = { {0, 0, 1}, {1, 0, 0}, {0, 1, 0} };
```

Выходные данные:

```
Матрица: 
0 0 1 
1 0 0 
0 1 0 
Является ортонормированной
```

### Пример 3.

Входные данные: 

```cpp
const int n = 4;
int matrix[n][n] = { {0, 0, 0, 1}, {0, 0, 1, 0}, {1, 0, 0, 0}, {0, 1, 0, 0} };
```

Выходные данные:

```
Матрица: 
0 0 0 1 
0 0 1 0 
1 0 0 0 
0 1 0 0 
Является ортонормированной
```