Бакин Владислав Артемович

ИВТ-23-1б

# 1 Вариант задания

Лабораторная работа № 4, вариант 5

**Работа с одномерными массивами**

Задание:
1. Сформировать одномерный массив целых чисел, используя датчик случайных чисел.
2. Распечатать полученный массив.
3. Удалить элементы кратные 7.
4. Добавить после каждого нечетного элемента массива элемент со значением 0.
5. Распечатать полученный массив.

# 2.1 Код программы

```cpp
#include <iostream>
using namespace std;

// Лабораторная работа № 4, вариант 5
int main() {
    int N;
    cin >> N;         // Количество элементов массива, которое задается пользователем.
    int array[N * 2]; // Делаем больше, т. к. должны будем в будущем добавлять элементы, в случае нахождения нечетных.
    int start = -100, finish = 100;     // Для ограничения случаиных значений элементов массива от -100 до 100.

    for (int i = 0; i < N; i++) {
        array[i] = (rand() % (finish - start + 1)) + start;
    }

    cout << "Исходный массив: " << endl;
    for (int i = 0; i < N; i++) {
        cout << array[i] << " ";
    }

    // Удаляем каждый элемент, кратный 7:
    for (int i = 0; i < N; i++) {
        if (array[i] % 7 == 0) {
            for (int j = i; j < N - 1; j++) {
                array[j] = array[j + 1];
            }
            N--;    // т.к. мы удаляем элемент из массива, то его длина становится на 1 меньше.
            i--;    /* т.к. мы, после удаления элемента из массива, смещаем остальные элементы, 
            то индекс следующего станет на 1 меньше. 
            Для того, чтобы рассмотреть его при следующей итерации цикла, мы должны уменьшить i на 1. */
        }
    }

    // Добавляем после каждого нечетного элемента массива элемент со значением 0:
    for (int i = 0; i < N; i++) {
        if (array[i] % 2 != 0) {
            N++;    // т.к. мы добавляем элемент, то длина массива увеличивается на 1.
            for (int j = N; j > i; j--) {
                array[j] = array[j - 1]; 
            }
            array[i + 1] = 0;
            i++;    // т.к. мы добавили элемент, который мы не должны рассматривать при следующей итерации цикла, то увеличиваем i на 1
        }
    }

    cout << endl << "Массив посхе всех преобразований: " << endl;
    for (int i = 0; i < N; i++) {
        cout << array[i] << " ";
    }
    
    return 0;
}
```

# 2.2 Блок-схема программы

<image src="4_5.png">

# 3 Тесты

### Пример 1.

Входные данные:

`20`

Выходные данные:

```
Исходный массив: 
-81 0 47 84 55 -3 -33 29 5 -93 -47 72 34 -15 43 0 98 -73 -9 -18 
Массив после всех преобразований: 
-81 0 47 0 55 0 -3 0 -33 0 29 0 5 0 -93 0 -47 0 72 34 -15 0 43 0 -73 0 -9 0 -18
```

### Пример 2.

Входные данные:

`50`

Выходные данные:

```
Исходный массив: 
-81 0 47 84 55 -3 -33 29 5 -93 -47 72 34 -15 43 0 98 -73 -9 -18 -44 67 86 -94 -77 -59 82 -90 60 -21 61 29 80 -43 -38 -16 54 30 63 -42 -13 -85 80 -80 -50 -27 -29 -53 -50 62 
Массив после всех преобразований: 
-81 0 47 0 55 0 -3 0 -33 0 29 0 5 0 -93 0 -47 0 72 34 -15 0 43 0 -73 0 -9 0 -18 -44 67 0 86 -94 -59 0 82 -90 60 61 0 29 0 80 -43 0 -38 -16 54 30 -13 0 -85 0 80 -80 -50 -27 0 -29 0 -53 0 -50 62
```

### Пример 3.

Входные данные:

`23`

Выходные данные:

```
Исходный массив: 
-81 0 47 84 55 -3 -33 29 5 -93 -47 72 34 -15 43 0 98 -73 -9 -18 -44 67 86 
Массив после всех преобразований: 
-81 0 47 0 55 0 -3 0 -33 0 29 0 5 0 -93 0 -47 0 72 34 -15 0 43 0 -73 0 -9 0 -18 -44 67 0 86
```

