Бакин Владислав Артемович

ИВТ-23-1б

# 1 Вариант задания

Лабораторная работа № 1

Заполнить двумернный массив: если сумма номер (не индекс) строки и столбца, т.е. i + j, будет нечетна, то на место этого элемента ставится 0. Все другие элементы заполняются цифрами от 1 до 9 последовательно, пропуская те элементы, которые заняты нулями.

Пример: матрица 5x5 (m = 5, n = 5;)

Выходные данные:

```
1 0 2 0 3
0 4 0 5 0
6 0 7 0 8
0 9 0 1 0
2 0 3 0 4
```

# 2.1 Код программы

```cpp
#include <iostream>
using namespace std;


int main() {
    const int m = 5, n = 5;
    int array[m][n];
    int cur_num = 1;

    for (int i = 1; i <= m; i++) {
        for (int j = 1; j <= n; j++) {
            if ((i + j) % 2 != 0) {
                array[i - 1][j - 1] = 0;
            }
            else {
                array[i - 1][j - 1] = cur_num;
                cur_num++;
                if (cur_num == 10) {
                    cur_num = 1;
                }
            }
        }
    }

    for (int i = 0; i < m; i++) {
        for (int j = 0; j < n; j++) {
            cout << array[i][j] << " ";
        }
        cout << endl;
    }

    return 0;
}
```

# 2.2 Блок-схема программы

<image src="images/1.png">

# 3 Тесты

### Пример 1.

Входные данные:

`const int m = 5, n = 5;`

Выходные данные:

```
1 0 2 0 3
0 4 0 5 0
6 0 7 0 8
0 9 0 1 0
2 0 3 0 4
```

### Пример 2.

Входные данные:

`const int m = 12, n = 12;`

Выходные данные:

```
1 0 2 0 3 0 4 0 5 0 6 0 
0 7 0 8 0 9 0 1 0 2 0 3 
4 0 5 0 6 0 7 0 8 0 9 0 
0 1 0 2 0 3 0 4 0 5 0 6 
7 0 8 0 9 0 1 0 2 0 3 0 
0 4 0 5 0 6 0 7 0 8 0 9 
1 0 2 0 3 0 4 0 5 0 6 0 
0 7 0 8 0 9 0 1 0 2 0 3 
4 0 5 0 6 0 7 0 8 0 9 0 
0 1 0 2 0 3 0 4 0 5 0 6 
7 0 8 0 9 0 1 0 2 0 3 0 
0 4 0 5 0 6 0 7 0 8 0 9 
```

### Пример 3.

Входные данные:

`const int m = 10, n = 7;`

Выходные данные:

```
1 0 2 0 3 0 4 
0 5 0 6 0 7 0 
8 0 9 0 1 0 2 
0 3 0 4 0 5 0 
6 0 7 0 8 0 9 
0 1 0 2 0 3 0 
4 0 5 0 6 0 7 
0 8 0 9 0 1 0 
2 0 3 0 4 0 5 
0 6 0 7 0 8 0 
```