Бакин Владислав Артемович

ИВТ-23-1б

# 1 Вариант задания

Лабораторная работа № 10, вариант 5

Написать программу, в которой создаются динамические массивы и выполнить их обработку в соответствии со своим вариантом.

Сформировать одномерный массив. Удалить из него К элементов, начиная с заданного номера, добавить К элементов, начиная с заданного номера;

# 2.1 Код программы

```cpp
#include <iostream>
using namespace std;


void FillArray(int *arr, int size) {
    for (int i = 0; i < size; i++) {
        arr[i] = rand() % 100;
    }
}


void ShowArray(int *arr, int size) {
    for (int i = 0; i < size; i++) {
        cout << arr[i] << " ";
    }
    cout << endl;
}


void DeleteElements(int *&arr, int &size, int K, int pos) {
    int *newNumbers = {new int[size - K]};
    for (int i = 0; i < pos - 1; i++) {
        newNumbers[i] = arr[i];
    }


    for (int i = pos - 1 + K; i < size; i++) {
        newNumbers[i - K] = arr[i];
    }
    size -= K;
    delete [] arr;
    arr = newNumbers;
}


void AddElements(int *&arr, int &size, int K, int pos) {
    int *newNumbers = {new int[size + K]};
    for (int i = 0; i < pos - 1; i++) {
        newNumbers[i] = arr[i];
    }
    
    int newNumber;
    cout << "Введите K новых чисел:" << endl;
    for (int i = pos - 1; i < pos - 1 + K; i++) {
        cin >> newNumber;
        newNumbers[i] = newNumber;
    }
    
    for (int i = pos - 1 + K; i < size + K; i++) {
        newNumbers[i] = arr[i - K];
    }

    size += K;
    delete [] arr;
    arr = newNumbers;
}


int main() {
    int n;
    cout << "Введите количество элементов в массиве:" << endl;
    cin >> n;
    int *numbers {new int[n]};
    FillArray(numbers, n);

    cout << "Массив до преобразований:" << endl;
    ShowArray(numbers, n);
    
    int K, pos1;
    cout << "Введите число K и номер, с какого элемента удалить K элементов:" << endl;
    cin >> K >> pos1;
    DeleteElements(numbers, n, K, pos1);

    cout << "Массив после удаления:" << endl;
    ShowArray(numbers, n);

    int pos2;
    cout << "Введите номер (ДЛЯ НОВГО МАССИВА), c какого элемента добавить K элементов:" << endl;
    cin >> pos2;
    AddElements(numbers, n, K, pos2);
    
    cout << "Массив после добавления:" << endl;
    ShowArray(numbers, n);

    delete [] numbers;
    numbers = nullptr; 

    return 0;
}
```

# 2.2 Блок-схема программы

<image src="images/10.png">

# 3 Тесты

# Пример 1

```
Введите количество элементов в массиве:
10
Массив до преобразований:
83 86 77 15 93 35 86 92 49 21 
Введите число K и номер, с какого элемента удалить K элементов:
3 2
Массив после удаления:
83 93 35 86 92 49 21 
Введите номер (ДЛЯ НОВГО МАССИВА), c какого элемента добавить K элементов:
8
Введите K новых чисел:
1
2
3
Массив после добавления:
83 93 35 86 92 49 21 1 2 3 
```

# Пример 2

```
Введите количество элементов в массиве:
15
Массив до преобразований:
83 86 77 15 93 35 86 92 49 21 62 27 90 59 63 
Введите число K и номер, с какого элемента удалить K элементов:
5 3
Массив после удаления:
83 86 92 49 21 62 27 90 59 63 
Введите номер (ДЛЯ НОВГО МАССИВА), c какого элемента добавить K элементов:
6
Введите K новых чисел:
100
100
100
100
100
Массив после добавления:
83 86 92 49 21 100 100 100 100 100 62 27 90 59 63 
```

# Пример 3

```
Введите количество элементов в массиве:
30
Массив до преобразований:
83 86 77 15 93 35 86 92 49 21 62 27 90 59 63 26 40 26 72 36 11 68 67 29 82 30 62 23 67 35 
Введите число K и номер, с какого элемента удалить K элементов:
10
10
Массив после удаления:
83 86 77 15 93 35 86 92 49 36 11 68 67 29 82 30 62 23 67 35 
Введите номер (ДЛЯ НОВГО МАССИВА), c какого элемента добавить K элементов:
1
Введите K новых чисел:
-1
-2
-3
-4
-5
-6
-7
-8
-9
-10
Массив после добавления:
-1 -2 -3 -4 -5 -6 -7 -8 -9 -10 83 86 77 15 93 35 86 92 49 36 11 68 67 29 82 30 62 23 67 35 
```