Бакин Владислав Артемович

ИВТ-23-1б

# 1 Вариант задания

Лабораторная работа № 7_2 вариант 5

Решить указанную в варианте задачу, используя функции с переменным числом параметров.

Написать функцию sum с переменным числом параметров, которая находит сумму чисел типа int по формуле: `S=a1*a2-a2*a3+a3*a4-. . .`. Написать вызывающую функцию main, которая обращается к функции sum не менее трех раз с количеством параметров 5, 10, 12.

# 2.1 Код программы

```cpp
#include <iostream>
#include <stdarg.h>
using namespace std;


int sum(const int k, ...) {
    va_list args;
    va_start(args, k);
    int result = 0;
    int tmp = 0;
    int cur_term = 0;
    int terms[k - 1];

    for (int i = 0; i < k; i++) {
        tmp = va_arg(args, int);
        if (i == 0) {
            cur_term = tmp;
        }
        else {
            cur_term *= tmp;
            terms[i - 1] = cur_term;
            cur_term = tmp;
        }
    }

    for (int i = 0; i < k - 1; i++) {
        if (i % 2 == 0) {
            result += terms[i];
        }
        else {
            result -= terms[i];
        }
    }

    va_end(args);
    return result;
}




int main() {
    cout << sum(5, 1, 2, 3, 4, 5) << endl;
    cout << sum(10, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10) << endl;
    cout << sum(12, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12) << endl;


    return 0;
}
```

# 2.2 Блок-схема программы

<image src="images/7_2_5.png">

# Тесты

### Пример 1

Входные данные:

```
cout << sum(5, 1, 2, 3, 4, 5) << endl;
cout << sum(10, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10) << endl;
cout << sum(12, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12) << endl;
```

Выходные данные:

```
-12
50
72
```

### Пример 2

Входные данные:

```
cout << sum(5, 1, -2, 3, -4, 5) << endl;
cout << sum(10, -1, 2, -3, 4, -5, 6, -7, 8, -9, 10) << endl;
cout << sum(12, 1, -2, 3, -4, 5, -6, 7, -8, 9, -10, 11, -12) << endl;
```

Выходные данные:

```
12
-50
-72
```

### Пример 3

Входные данные:

```
cout << sum(5, 31, 42, 32, 34, 32) << endl;
cout << sum(10, 24, 43, 43, 24, 45, 46, 37, 38, 34, 30) << endl;
cout << sum(12, 41, 42, 43, 44, 34, 43, 37, 48, 39, 30, 11, 12) << endl;
```

Выходные данные:

```
-42
637
1059
```